app/views/feed/index.html.erb

                  <%= link_to 'Show', book_path(book), :class => "btn btn-sm btn-outline-secondary" %>
                  <button type="button" class="btn btn-sm btn-outline-secondary" disabled><%= book.trades.count > 0 ? 'Has offers' : 'Has no offers'%></button>
---
SELECT COUNT(*) FROM "trades" WHERE "trades"."book_id" = $1  [["book_id", 6]]