app/views/dashboard/index.html.erb

    <div class="card m-2" style="width: 18rem;">
      <div class="card-header">Book: <%= @my_books.where(:id => trade.book_id).first.title %></div>
      <ul class="list-group list-group-flush">
        <li class="list-group-item">Sender: <%= @users.where(:id => trade.sender_id).first.username %></li>
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 ORDER BY "books"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

    <div class="card m-2" style="width: 18rem;">
      <div class="card-header">You offered for <b><%= @books.where(:id => trade.book_id).first.title %></b></div>
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 ORDER BY "books"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]

  <% @my_books.each do |book| %>
    <% book.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = $1  [["book_id", 6]]