app/views/users/show.html.erb

    <div class="row">
      <% @user.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = $1  [["user_id", 1]]