app/views/books/show.html.erb

  <div class="form-group">
    <%= form.collection_select :proposed_book_id, current_user.books.where(shared: :true).order(:title),:id,:title, include_blank: true, :class => 'form-control' %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = $1 AND "books"."shared" = $2 ORDER BY "books"."title" ASC  [["user_id", 2], ["shared", true]]

    <div class="row">
      <% @book.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = $1  [["book_id", 6]]