app/controllers/books_controller.rb

  def create
    @book = current_user.books.build(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at", "pagecount", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Pal Sokagi Cocuklari"], ["author", "Ferenc Molnar"], ["created_at", "2020-11-09 11:29:42.330033"], ["updated_at", "2020-11-09 11:29:42.330033"], ["pagecount", 244], ["user_id", 1]]

  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "shared" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["shared", false], ["updated_at", "2020-11-08 19:54:40.788902"], ["id", 4]]