app/controllers/comments_controller.rb

  def show
    @book = Book.find(params[:id])
    @comment = Comment.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def edit
    @book = Book.find(params[:id])
    @comment = Comment.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @book = Book.find(params[:book_id])
    @comment = @book.comments.create(comment_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("title", "content", "approved", "book_id", "created_at", "updated_at", "commenter") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @comment = Comment.find(params[:id])

    if @comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
UPDATE "comments" SET "approved" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["approved", true], ["updated_at", "2020-10-30 17:19:56.151891"], ["id", 68]]