app/controllers/dashboard_controller.rb

  def index
    @books = Book.all
    @my_books = current_user.books
    @comments = Comment.where(commenter: current_user.username)
    @users = User.all
    @trades = Trade.all
---
SELECT "books".* FROM "books"
SELECT "comments".* FROM "comments" WHERE "comments"."commenter" = $1  [["commenter", "utkucb"]]
SELECT "trades".* FROM "trades"