app/controllers/feed_controller.rb

SELECT "books".* FROM "books" WHERE "books"."shared" = $1  [["shared", true]]
---
  def index
    @books = Book.where(shared: :true)