app/controllers/trades_controller.rb

SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @trade = Trade.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params[:book_id])
    @trade = Trade.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "trades" ("sender_id", "recipient_id", "book_id", "proposed_book_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["sender_id", 2], ["recipient_id", 1], ["book_id", 8], ["proposed_book_id", 6], ["status", 0], ["created_at", "2020-11-09 13:33:59.733463"], ["updated_at", "2020-11-09 13:33:59.733463"]]
---
  def create
    @book = Book.find(params[:book_id])
    @trade = @book.trades.create(trade_params)

SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "trades" SET "status" = $1, "updated_at" = $2 WHERE "trades"."id" = $3  [["status", 1], ["updated_at", "2020-11-08 20:31:18.336659"], ["id", 1]]
---
  def update
    @books = Book.all
    @trade = Trade.find(params[:id])

    if @trade.update(trade_params)