app/controllers/welcome_controller.rb

SELECT "books".* FROM "books" WHERE "books"."shared" = $1  [["shared", true]]
---
  def index
    if current_user
      redirect_to feed_url
    else
      @books = Book.where(shared: :true)